/* eslint-disable */
// 养老库字段对应数据
export default {
  state: {
    // 月总收入
    monthlyIncome:{
      "0": "-",
      "1": "无收入",
      "2": "1000元以下",
      "3": "1001-2000元",
      "4": "2001-3000元",
      "5": "3001-4000元",
      "6": "4001-5000元",
      "7": "5000元以上"
    },
    // 是否独居
    isOnlyHouse:{
      "0": "否",
      "1": "是"
    },
    // 身体状况
    personbody:{
      "0": "",
      "1": "完全自理",
      "2": "半失能",
      "3": "失能"
    },
    // 是否困难
    isPoverty:{
      "0": "否",
      "1": "是"
    },
    // 是否户籍
    isHousehx:{
      "0": "否",
      "1": "是"
    },
    // 是否失独
    isLiveAlone: {
      "0": "否",
      "1": "是"
    },
    // 是否社保
    haveShebao: {
      "0": "否",
      "1": "是"
    },
    // 是否卫健
    haveWeijian: {
      "0": "否",
      "1": "是"
    },
    isSubsidy: {
      "0": "否",
      "1": "是"
    }
  }

}
